# int float bool listin string tuple set dict

# a =  inpyt ("<<")
# a = int(a)
# #спросить пять раз данные у пользователя
# a =[]
# for _ in range(5) #(цикл повторяется 5 раз)
#     n = int (input (',,'))№( выводить то что вводит пользователь)
#     a .apend(n)
#     if n % 2 == 0; (только четные числа)


# print(a)
# a=[]
# for _ in range(5) #(цикл повторяется 5 раз)
#     n = int (input (',,'))#( выводить то что вводит пользователь)
#     while n % 2 == 0:
#          a.apend(n) 
#     else: 
#         print ('ples povtor')


# a = []
# for _ in range(5): # цикл повторяетс =я 5 раз
#     n = int(input("> "))
#     while n % 2 != 0:
#             print("pleas reapet")
#             n = int(input(">>"  ))
#     else:
#         a.append(n)
#         print (a)



    # numbers = []
    # n = int(input ("enter a number"))
    # while len(numbers) < 5: #потоврять цкл пока длина numbers не станет 5 значений
    #     if n % 2 == 0: # если н делится на 2 без остатка(выесняем четное илм не четное число) то 
    #         numbers.append(n) # помещаем его в намберс
    #     n = int(input("enter a number"))
    #     print(numbers)



# import time 
# import os

# for h in range (24):
#     for m in range(60):
#         for s in range(60):
#             time.sleep (0.1)
#             print (f"{h}:{m}:{s}")
        
#             os.system("clear")



# for n in range(1,10,3 ):
#     for m in range (1,10):
#         print(f"{n} * {m} = {n*m} \t {n +1} * {m} = {(n+1)*m} \t {n+2} * {m} = {(n+2)*m} \t {n+3} * {m} = {(n+3)*m}")
#     print()
        
# #list comrecation
# s = [i for i in TEXT]
# print(s)


# s = ['Sultan', 'Asik', 'Mars', 'Sasha', 'ERJ', \
#      'Alibek', 'Kirill', 'Rustam', 'Janbolat', 'Vlad']
# #s = {i:j for i, j in enumerate([1, 2, 3, 4, 5, 6, 7, 8])}
# s = {i:j for i, j in enumerate(s)}
# print (s)

#Напишите программу, которая выводит факториал числа 
for n in range (5):
    for m in range (5):
        print (f"t = n*5")
        


